app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "username", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('B_GZdKdtn4u7WXHP0tJH', '2010-05-26 12:12:37.656821', '2010-05-26 12:12:37.657491', '5b4082f445abaaa49d4f2431f47875e743d30d545382f254f2470613fa84c8c904466e4a4496b5080765323ee5188c181f4ded8345dd6383595f9eda54e6be65', '75OfOKkJRtwq67tA3wD4', '2010-05-26 12:12:37.657491', 'simon', 0, '127.0.0.1', 'YyXFvhtlO7_Hi2x4XxTj', '2010-05-26 12:12:37.651240', 'be15637008530bcce30f23b3208fee7ddf07052dcebe973ca8efe8e9df872a9302ab9d24029188fb86eb468f7acc61257cfe7d8d3eab7c0c20cca51caf9cd554', 1, NULL, NULL, 'simon@japancentre.com') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2010-05-26 12:21:57.542341', "perishable_token" = '_0d3HFCZfdVdykHt5jEf' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])